CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_technology_abstraction_clock.h
/***************************************************************************//**
 * @file
 * @brief Device Manager Clocks.
 *******************************************************************************
 * # License
 * <b>Copyright 2024 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/

#ifndef SL_TECHNOLOGY_ABSTRACTION_CLOCK_H
#define SL_TECHNOLOGY_ABSTRACTION_CLOCK_H

#include "sl_enum.h"
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************//**
 * @addtogroup technology_abstraction_clock Technology Abstraction Clock
 * @brief Technology Abstraction Clock
 * @details
 * ## Overview
 *
 * TODO
 *
 * @{
 ******************************************************************************/

/*******************************************************************************
 ********************************   DEFINES   **********************************
 ******************************************************************************/

// CLKEN bitfield shift in bus clock value.
#define _BUS_CLOCK_CLKEN_BIT_SHIFT 0

// CLKEN bitfield mask in bus clock value.
#define _BUS_CLOCK_CLKEN_BIT_MASK  0x3FUL

// CLKENx register number shift in bus clock value.
#define _BUS_CLOCK_CLKENX_SHIFT  6

// CLKENx register number mask in bus clock value.
#define _BUS_CLOCK_CLKENX_MASK   0x1C0UL

// CLKEN0 value in bus clock.
#define BUS_CLOCK_CLKEN0   0x0UL

// CLKEN1 value in bus clock.
#define BUS_CLOCK_CLKEN1   0x1UL

// CLKEN2 value in bus clock.
#define BUS_CLOCK_CLKEN2   0x2UL

// CLKENHV value in bus clock.
#define BUS_CLOCK_CLKENHV  0x3UL

/// Define for INVALID peripheral bus clock pointer.
#define SL_BUS_CLOCK_INVALID (0)

/// Define for ACMP0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_ACMP0 (&SL_BUS_CLOCK_ACMP0_VALUE)

/// Define for ACMP1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_ACMP1 (&SL_BUS_CLOCK_ACMP1_VALUE)

/// Define for ADC0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_ADC0 (&SL_BUS_CLOCK_ADC0_VALUE)

/// Define for AGC peripheral bus clock pointer.
#define SL_BUS_CLOCK_AGC (&SL_BUS_CLOCK_AGC_VALUE)

/// Define for AMUXCP0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_AMUXCP0 (&SL_BUS_CLOCK_AMUXCP0_VALUE)

/// Define for BUFC peripheral bus clock pointer.
#define SL_BUS_CLOCK_BUFC (&SL_BUS_CLOCK_BUFC_VALUE)

/// Define for BURAM peripheral bus clock pointer.
#define SL_BUS_CLOCK_BURAM (&SL_BUS_CLOCK_BURAM_VALUE)

/// Define for BURTC peripheral bus clock pointer.
#define SL_BUS_CLOCK_BURTC (&SL_BUS_CLOCK_BURTC_VALUE)

/// Define for CRYPTOACC peripheral bus clock pointer.
#define SL_BUS_CLOCK_CRYPTOACC (&SL_BUS_CLOCK_CRYPTOACC_VALUE)

/// Define for DCDC peripheral bus clock pointer.
#define SL_BUS_CLOCK_DCDC (&SL_BUS_CLOCK_DCDC_VALUE)

/// Define for DEVINFO peripheral bus clock pointer.
#define SL_BUS_CLOCK_DEVINFO (&SL_BUS_CLOCK_DEVINFO_VALUE)

/// Define for DMEM peripheral bus clock pointer.
#define SL_BUS_CLOCK_DMEM (&SL_BUS_CLOCK_DMEM_VALUE)

/// Define for DPLL0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_DPLL0 (&SL_BUS_CLOCK_DPLL0_VALUE)

/// Define for ECAIFADC peripheral bus clock pointer.
#define SL_BUS_CLOCK_ECAIFADC (&SL_BUS_CLOCK_ECAIFADC_VALUE)

/// Define for ETAMPDET peripheral bus clock pointer.
#define SL_BUS_CLOCK_ETAMPDET (&SL_BUS_CLOCK_ETAMPDET_VALUE)

/// Define for EUART0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_EUART0 (&SL_BUS_CLOCK_EUART0_VALUE)

/// Define for EUSART0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_EUSART0 (&SL_BUS_CLOCK_EUSART0_VALUE)

/// Define for EUSART1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_EUSART1 (&SL_BUS_CLOCK_EUSART1_VALUE)

/// Define for EUSART2 peripheral bus clock pointer.
#define SL_BUS_CLOCK_EUSART2 (&SL_BUS_CLOCK_EUSART2_VALUE)

/// Define for EUSART3 peripheral bus clock pointer.
#define SL_BUS_CLOCK_EUSART3 (&SL_BUS_CLOCK_EUSART3_VALUE)

/// Define for EUSART4 peripheral bus clock pointer.
#define SL_BUS_CLOCK_EUSART4 (&SL_BUS_CLOCK_EUSART4_VALUE)

/// Define for FRC peripheral bus clock pointer.
#define SL_BUS_CLOCK_FRC (&SL_BUS_CLOCK_FRC_VALUE)

/// Define for FSRCO peripheral bus clock pointer.
#define SL_BUS_CLOCK_FSRCO (&SL_BUS_CLOCK_FSRCO_VALUE)

/// Define for GPCRC0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_GPCRC0 (&SL_BUS_CLOCK_GPCRC0_VALUE)

/// Define for GPIO peripheral bus clock pointer.
#define SL_BUS_CLOCK_GPIO (&SL_BUS_CLOCK_GPIO_VALUE)

/// Define for HFRCO0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_HFRCO0 (&SL_BUS_CLOCK_HFRCO0_VALUE)

/// Define for HFRCOEM23 peripheral bus clock pointer.
#define SL_BUS_CLOCK_HFRCOEM23 (&SL_BUS_CLOCK_HFRCOEM23_VALUE)

/// Define for HFXO0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_HFXO0 (&SL_BUS_CLOCK_HFXO0_VALUE)

/// Define for HOSTMAILBOX peripheral bus clock pointer.
#define SL_BUS_CLOCK_HOSTMAILBOX (&SL_BUS_CLOCK_HOSTMAILBOX_VALUE)

/// Define for HOSTPORTAL peripheral bus clock pointer.
#define SL_BUS_CLOCK_HOSTPORTAL (&SL_BUS_CLOCK_HOSTPORTAL_VALUE)

/// Define for I2C0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_I2C0 (&SL_BUS_CLOCK_I2C0_VALUE)

/// Define for I2C1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_I2C1 (&SL_BUS_CLOCK_I2C1_VALUE)

/// Define for I2C2 peripheral bus clock pointer.
#define SL_BUS_CLOCK_I2C2 (&SL_BUS_CLOCK_I2C2_VALUE)

