CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_technology_abstraction_clock.h
/// Define for I2C3 peripheral bus clock pointer.
#define SL_BUS_CLOCK_I2C3 (&SL_BUS_CLOCK_I2C3_VALUE)

/// Define for IADC0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_IADC0 (&SL_BUS_CLOCK_IADC0_VALUE)

/// Define for ICACHE0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_ICACHE0 (&SL_BUS_CLOCK_ICACHE0_VALUE)

/// Define for IFADCDEBUG peripheral bus clock pointer.
#define SL_BUS_CLOCK_IFADCDEBUG (&SL_BUS_CLOCK_IFADCDEBUG_VALUE)

/// Define for KEYSCAN peripheral bus clock pointer.
#define SL_BUS_CLOCK_KEYSCAN (&SL_BUS_CLOCK_KEYSCAN_VALUE)

/// Define for KSU peripheral bus clock pointer.
#define SL_BUS_CLOCK_KSU (&SL_BUS_CLOCK_KSU_VALUE)

/// Define for L2ICACHE0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_L2ICACHE0 (&SL_BUS_CLOCK_L2ICACHE0_VALUE)

/// Define for LCD peripheral bus clock pointer.
#define SL_BUS_CLOCK_LCD (&SL_BUS_CLOCK_LCD_VALUE)

/// Define for LDMA0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_LDMA0 (&SL_BUS_CLOCK_LDMA0_VALUE)

/// Define for LDMAXBAR0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_LDMAXBAR0 (&SL_BUS_CLOCK_LDMAXBAR0_VALUE)

/// Define for LEDDRV0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_LEDDRV0 (&SL_BUS_CLOCK_LEDDRV0_VALUE)

/// Define for LESENSE peripheral bus clock pointer.
#define SL_BUS_CLOCK_LESENSE (&SL_BUS_CLOCK_LESENSE_VALUE)

/// Define for LETIMER0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_LETIMER0 (&SL_BUS_CLOCK_LETIMER0_VALUE)

/// Define for LFRCO peripheral bus clock pointer.
#define SL_BUS_CLOCK_LFRCO (&SL_BUS_CLOCK_LFRCO_VALUE)

/// Define for LFXO peripheral bus clock pointer.
#define SL_BUS_CLOCK_LFXO (&SL_BUS_CLOCK_LFXO_VALUE)

/// Define for LPW0PORTAL peripheral bus clock pointer.
#define SL_BUS_CLOCK_LPW0PORTAL (&SL_BUS_CLOCK_LPW0PORTAL_VALUE)

/// Define for MODEM peripheral bus clock pointer.
#define SL_BUS_CLOCK_MODEM (&SL_BUS_CLOCK_MODEM_VALUE)

/// Define for MSC peripheral bus clock pointer.
#define SL_BUS_CLOCK_MSC (&SL_BUS_CLOCK_MSC_VALUE)

/// Define for MVP peripheral bus clock pointer.
#define SL_BUS_CLOCK_MVP (&SL_BUS_CLOCK_MVP_VALUE)

/// Define for PCNT0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_PCNT0 (&SL_BUS_CLOCK_PCNT0_VALUE)

/// Define for PDM peripheral bus clock pointer.
#define SL_BUS_CLOCK_PDM (&SL_BUS_CLOCK_PDM_VALUE)

/// Define for PIXELRZ0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_PIXELRZ0 (&SL_BUS_CLOCK_PIXELRZ0_VALUE)

/// Define for PIXELRZ1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_PIXELRZ1 (&SL_BUS_CLOCK_PIXELRZ1_VALUE)

/// Define for PRORTC peripheral bus clock pointer.
#define SL_BUS_CLOCK_PRORTC (&SL_BUS_CLOCK_PRORTC_VALUE)

/// Define for PROTIMER peripheral bus clock pointer.
#define SL_BUS_CLOCK_PROTIMER (&SL_BUS_CLOCK_PROTIMER_VALUE)

/// Define for PRS peripheral bus clock pointer.
#define SL_BUS_CLOCK_PRS (&SL_BUS_CLOCK_PRS_VALUE)

/// Define for RAC peripheral bus clock pointer.
#define SL_BUS_CLOCK_RAC (&SL_BUS_CLOCK_RAC_VALUE)

/// Define for RADIOAES peripheral bus clock pointer.
#define SL_BUS_CLOCK_RADIOAES (&SL_BUS_CLOCK_RADIOAES_VALUE)

/// Define for RDMAILBOX0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_RDMAILBOX0 (&SL_BUS_CLOCK_RDMAILBOX0_VALUE)

/// Define for RDMAILBOX1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_RDMAILBOX1 (&SL_BUS_CLOCK_RDMAILBOX1_VALUE)

/// Define for RDSCRATCHPAD peripheral bus clock pointer.
#define SL_BUS_CLOCK_RDSCRATCHPAD (&SL_BUS_CLOCK_RDSCRATCHPAD_VALUE)

/// Define for RFCRC peripheral bus clock pointer.
#define SL_BUS_CLOCK_RFCRC (&SL_BUS_CLOCK_RFCRC_VALUE)

/// Define for RFECA0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_RFECA0 (&SL_BUS_CLOCK_RFECA0_VALUE)

/// Define for RFECA1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_RFECA1 (&SL_BUS_CLOCK_RFECA1_VALUE)

/// Define for RFFPLL0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_RFFPLL0 (&SL_BUS_CLOCK_RFFPLL0_VALUE)

/// Define for RFMAILBOX peripheral bus clock pointer.
#define SL_BUS_CLOCK_RFMAILBOX (&SL_BUS_CLOCK_RFMAILBOX_VALUE)

/// Define for RFSCRATCHPAD peripheral bus clock pointer.
#define SL_BUS_CLOCK_RFSCRATCHPAD (&SL_BUS_CLOCK_RFSCRATCHPAD_VALUE)

/// Define for RFSENSE peripheral bus clock pointer.
#define SL_BUS_CLOCK_RFSENSE (&SL_BUS_CLOCK_RFSENSE_VALUE)

/// Define for RPA peripheral bus clock pointer.
#define SL_BUS_CLOCK_RPA (&SL_BUS_CLOCK_RPA_VALUE)

/// Define for RTCC peripheral bus clock pointer.
#define SL_BUS_CLOCK_RTCC (&SL_BUS_CLOCK_RTCC_VALUE)

/// Define for SCRATCHPAD peripheral bus clock pointer.
#define SL_BUS_CLOCK_SCRATCHPAD (&SL_BUS_CLOCK_SCRATCHPAD_VALUE)

/// Define for SEMAILBOX peripheral bus clock pointer.
#define SL_BUS_CLOCK_SEMAILBOX (&SL_BUS_CLOCK_SEMAILBOX_VALUE)

/// Define for SEMAPHORE0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_SEMAPHORE0 (&SL_BUS_CLOCK_SEMAPHORE0_VALUE)

/// Define for SEMAPHORE1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_SEMAPHORE1 (&SL_BUS_CLOCK_SEMAPHORE1_VALUE)

/// Define for SEPORTAL peripheral bus clock pointer.
#define SL_BUS_CLOCK_SEPORTAL (&SL_BUS_CLOCK_SEPORTAL_VALUE)

/// Define for SMU peripheral bus clock pointer.
#define SL_BUS_CLOCK_SMU (&SL_BUS_CLOCK_SMU_VALUE)

/// Define for SOCPLL0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_SOCPLL0 (&SL_BUS_CLOCK_SOCPLL0_VALUE)

/// Define for SYMCRYPTO peripheral bus clock pointer.
#define SL_BUS_CLOCK_SYMCRYPTO (&SL_BUS_CLOCK_SYMCRYPTO_VALUE)

/// Define for SYNTH peripheral bus clock pointer.
#define SL_BUS_CLOCK_SYNTH (&SL_BUS_CLOCK_SYNTH_VALUE)

/// Define for SYSCFG peripheral bus clock pointer.
#define SL_BUS_CLOCK_SYSCFG (&SL_BUS_CLOCK_SYSCFG_VALUE)

/// Define for SYSRTC0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_SYSRTC0 (&SL_BUS_CLOCK_SYSRTC0_VALUE)

/// Define for TIMER0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER0 (&SL_BUS_CLOCK_TIMER0_VALUE)

/// Define for TIMER1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER1 (&SL_BUS_CLOCK_TIMER1_VALUE)

/// Define for TIMER2 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER2 (&SL_BUS_CLOCK_TIMER2_VALUE)

