CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_technology_abstraction_clock.h
/// Define for TIMER3 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER3 (&SL_BUS_CLOCK_TIMER3_VALUE)

/// Define for TIMER4 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER4 (&SL_BUS_CLOCK_TIMER4_VALUE)

/// Define for TIMER5 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER5 (&SL_BUS_CLOCK_TIMER5_VALUE)

/// Define for TIMER6 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER6 (&SL_BUS_CLOCK_TIMER6_VALUE)

/// Define for TIMER7 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER7 (&SL_BUS_CLOCK_TIMER7_VALUE)

/// Define for TIMER8 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER8 (&SL_BUS_CLOCK_TIMER8_VALUE)

/// Define for TIMER9 peripheral bus clock pointer.
#define SL_BUS_CLOCK_TIMER9 (&SL_BUS_CLOCK_TIMER9_VALUE)

/// Define for ULFRCO peripheral bus clock pointer.
#define SL_BUS_CLOCK_ULFRCO (&SL_BUS_CLOCK_ULFRCO_VALUE)

/// Define for USART0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_USART0 (&SL_BUS_CLOCK_USART0_VALUE)

/// Define for USART1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_USART1 (&SL_BUS_CLOCK_USART1_VALUE)

/// Define for USART2 peripheral bus clock pointer.
#define SL_BUS_CLOCK_USART2 (&SL_BUS_CLOCK_USART2_VALUE)

/// Define for USB peripheral bus clock pointer.
#define SL_BUS_CLOCK_USB (&SL_BUS_CLOCK_USB_VALUE)

/// Define for VDAC0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_VDAC0 (&SL_BUS_CLOCK_VDAC0_VALUE)

/// Define for VDAC1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_VDAC1 (&SL_BUS_CLOCK_VDAC1_VALUE)

/// Define for WDOG0 peripheral bus clock pointer.
#define SL_BUS_CLOCK_WDOG0 (&SL_BUS_CLOCK_WDOG0_VALUE)

/// Define for WDOG1 peripheral bus clock pointer.
#define SL_BUS_CLOCK_WDOG1 (&SL_BUS_CLOCK_WDOG1_VALUE)

/*******************************************************************************
 *******************************   TYPEDEFS   **********************************
 ******************************************************************************/

/// The bus clock typedef.
typedef const uint32_t* sl_bus_clock_t;

/*******************************************************************************
 *******************************   EXTERNS   ***********************************
 ******************************************************************************/

/// External declaration for invalid peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_INVALID_VALUE;

/// External declaration for ACMP0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_ACMP0_VALUE;

/// External declaration for ACMP1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_ACMP1_VALUE;

/// External declaration for ADC0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_ADC0_VALUE;

/// External declaration for AGC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_AGC_VALUE;

/// External declaration for AMUXCP0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_AMUXCP0_VALUE;

/// External declaration for BUFC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_BUFC_VALUE;

/// External declaration for BURAM peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_BURAM_VALUE;

/// External declaration for BURTC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_BURTC_VALUE;

/// External declaration for CRYPTOACC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_CRYPTOACC_VALUE;

/// External declaration for DCDC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_DCDC_VALUE;

/// External declaration for DEVINFO peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_DEVINFO_VALUE;

/// External declaration for DMEM peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_DMEM_VALUE;

/// External declaration for DPLL0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_DPLL0_VALUE;

/// External declaration for ECAIFADC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_ECAIFADC_VALUE;

/// External declaration for ETAMPDET peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_ETAMPDET_VALUE;

/// External declaration for EUART0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_EUART0_VALUE;

/// External declaration for EUSART0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_EUSART0_VALUE;

/// External declaration for EUSART1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_EUSART1_VALUE;

/// External declaration for EUSART2 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_EUSART2_VALUE;

/// External declaration for EUSART3 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_EUSART3_VALUE;

/// External declaration for EUSART4 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_EUSART4_VALUE;

/// External declaration for FRC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_FRC_VALUE;

/// External declaration for FSRCO peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_FSRCO_VALUE;

/// External declaration for GPCRC0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_GPCRC0_VALUE;

/// External declaration for GPIO peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_GPIO_VALUE;

/// External declaration for HFRCO0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_HFRCO0_VALUE;

/// External declaration for HFRCOEM23 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_HFRCOEM23_VALUE;

/// External declaration for HFXO0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_HFXO0_VALUE;

/// External declaration for HOSTMAILBOX peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_HOSTMAILBOX_VALUE;

/// External declaration for HOSTPORTAL peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_HOSTPORTAL_VALUE;

/// External declaration for I2C0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_I2C0_VALUE;

/// External declaration for I2C1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_I2C1_VALUE;

/// External declaration for I2C2 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_I2C2_VALUE;

/// External declaration for I2C3 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_I2C3_VALUE;

/// External declaration for IADC0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_IADC0_VALUE;

