CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_technology_abstraction_clock.h
/// External declaration for ICACHE0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_ICACHE0_VALUE;

/// External declaration for IFADCDEBUG peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_IFADCDEBUG_VALUE;

/// External declaration for KEYSCAN peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_KEYSCAN_VALUE;

/// External declaration for KSU peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_KSU_VALUE;

/// External declaration for L2ICACHE0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_L2ICACHE0_VALUE;

/// External declaration for LCD peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_LCD_VALUE;

/// External declaration for LDMA0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_LDMA0_VALUE;

/// External declaration for LDMAXBAR0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_LDMAXBAR0_VALUE;

/// External declaration for LEDDRV0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_LEDDRV0_VALUE;

/// External declaration for LESENSE peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_LESENSE_VALUE;

/// External declaration for LETIMER0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_LETIMER0_VALUE;

/// External declaration for LFRCO peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_LFRCO_VALUE;

/// External declaration for LFXO peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_LFXO_VALUE;

/// External declaration for LPW0PORTAL peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_LPW0PORTAL_VALUE;

/// External declaration for MODEM peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_MODEM_VALUE;

/// External declaration for MSC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_MSC_VALUE;

/// External declaration for MVP peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_MVP_VALUE;

/// External declaration for PCNT0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_PCNT0_VALUE;

/// External declaration for PDM peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_PDM_VALUE;

/// External declaration for PIXELRZ0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_PIXELRZ0_VALUE;

/// External declaration for PIXELRZ1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_PIXELRZ1_VALUE;

/// External declaration for PRORTC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_PRORTC_VALUE;

/// External declaration for PROTIMER peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_PROTIMER_VALUE;

/// External declaration for PRS peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_PRS_VALUE;

/// External declaration for RAC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RAC_VALUE;

/// External declaration for RADIOAES peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RADIOAES_VALUE;

/// External declaration for RDMAILBOX0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RDMAILBOX0_VALUE;

/// External declaration for RDMAILBOX1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RDMAILBOX1_VALUE;

/// External declaration for RDSCRATCHPAD peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RDSCRATCHPAD_VALUE;

/// External declaration for RFCRC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RFCRC_VALUE;

/// External declaration for RFECA0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RFECA0_VALUE;

/// External declaration for RFECA1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RFECA1_VALUE;

/// External declaration for RFFPLL0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RFFPLL0_VALUE;

/// External declaration for RFMAILBOX peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RFMAILBOX_VALUE;

/// External declaration for RFSCRATCHPAD peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RFSCRATCHPAD_VALUE;

/// External declaration for RFSENSE peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RFSENSE_VALUE;

/// External declaration for RPA peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RPA_VALUE;

/// External declaration for RTCC peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_RTCC_VALUE;

/// External declaration for SCRATCHPAD peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SCRATCHPAD_VALUE;

/// External declaration for SEMAILBOX peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SEMAILBOX_VALUE;

/// External declaration for SEMAPHORE0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SEMAPHORE0_VALUE;

/// External declaration for SEMAPHORE1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SEMAPHORE1_VALUE;

/// External declaration for SEPORTAL peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SEPORTAL_VALUE;

/// External declaration for SMU peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SMU_VALUE;

/// External declaration for SOCPLL0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SOCPLL0_VALUE;

/// External declaration for SYMCRYPTO peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SYMCRYPTO_VALUE;

/// External declaration for SYNTH peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SYNTH_VALUE;

/// External declaration for SYSCFG peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SYSCFG_VALUE;

/// External declaration for SYSRTC0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_SYSRTC0_VALUE;

/// External declaration for TIMER0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER0_VALUE;

/// External declaration for TIMER1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER1_VALUE;

/// External declaration for TIMER2 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER2_VALUE;

/// External declaration for TIMER3 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER3_VALUE;

