CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/service/device_manager/inc/sl_technology_abstraction_clock.h
/// External declaration for TIMER4 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER4_VALUE;

/// External declaration for TIMER5 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER5_VALUE;

/// External declaration for TIMER6 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER6_VALUE;

/// External declaration for TIMER7 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER7_VALUE;

/// External declaration for TIMER8 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER8_VALUE;

/// External declaration for TIMER9 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_TIMER9_VALUE;

/// External declaration for ULFRCO peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_ULFRCO_VALUE;

/// External declaration for USART0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_USART0_VALUE;

/// External declaration for USART1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_USART1_VALUE;

/// External declaration for USART2 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_USART2_VALUE;

/// External declaration for USB peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_USB_VALUE;

/// External declaration for VDAC0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_VDAC0_VALUE;

/// External declaration for VDAC1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_VDAC1_VALUE;

/// External declaration for WDOG0 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_WDOG0_VALUE;

/// External declaration for WDOG1 peripheral bus clock value.
extern const uint32_t SL_BUS_CLOCK_WDOG1_VALUE;

/*******************************************************************************
 ********************************   ENUMS   ************************************
 ******************************************************************************/

/// Oscillators
SL_ENUM(sl_oscillator_t) {
  SL_OSCILLATOR_FSRCO,      ///< FSRCO Oscillator
  SL_OSCILLATOR_HFRCODPLL,  ///< HFRCODPLL Oscillator
  SL_OSCILLATOR_HFXO,       ///< HFXO Oscillator
  SL_OSCILLATOR_HFRCOEM23,  ///< HFRCOEM23 Oscillator
  SL_OSCILLATOR_RFFPLL,     ///< RFFPLL Oscillator
  SL_OSCILLATOR_USBPLL,     ///< USBPLL Oscillator
  SL_OSCILLATOR_SOCPLL,     ///< SOCPLL Oscillator
  SL_OSCILLATOR_LFXO,       ///< LFXO Oscillator
  SL_OSCILLATOR_LFRCO,      ///< LFRCO Oscillator
  SL_OSCILLATOR_ULFRCO,     ///< ULFRCO Oscillator
  SL_OSCILLATOR_CLKIN0      ///< CLKIN0 Oscillator
};

/// Clock Branches
SL_ENUM(sl_clock_branch_t) {
  SL_CLOCK_BRANCH_SYSCLK,        ///< SYSCLK Clock Branch
  SL_CLOCK_BRANCH_HCLK,          ///< HCLK Clock Branch
  SL_CLOCK_BRANCH_HCLKRADIO,     ///< HCLK Radio Clock Branch
  SL_CLOCK_BRANCH_PCLK,          ///< PCLK Clock Branch
  SL_CLOCK_BRANCH_LSPCLK,        ///< LSPCLK Clock Branch
  SL_CLOCK_BRANCH_TRACECLK,      ///< TRACECLK Clock Branch
  SL_CLOCK_BRANCH_EXPORTCLK,     ///< EXPORTCLK Clock Branch
  SL_CLOCK_BRANCH_EM01GRPACLK,   ///< EM01GRPACLK Clock Branch
  SL_CLOCK_BRANCH_EM01GRPBCLK,   ///< EM01GRPBCLK Clock Branch
  SL_CLOCK_BRANCH_EM01GRPCCLK,   ///< EM01GRPCCLK Clock Branch
  SL_CLOCK_BRANCH_EM01GRPDCLK,   ///< EM01GRPDCLK Clock Branch
  SL_CLOCK_BRANCH_EM23GRPACLK,   ///< EM23GRPACLK Clock Branch
  SL_CLOCK_BRANCH_EM4GRPACLK,    ///< EM4GRPACLK Clock Branch
  SL_CLOCK_BRANCH_QSPISYSCLK,    ///< QSPISYSCLK Clock Branch
  SL_CLOCK_BRANCH_IADCCLK,       ///< IADCCLK Clock Branch
  SL_CLOCK_BRANCH_WDOG0CLK,      ///< WDOG0CLK Clock Branch
  SL_CLOCK_BRANCH_WDOG1CLK,      ///< WDOG1CLK Clock Branch
  SL_CLOCK_BRANCH_RTCCCLK,       ///< RTCCCLK Clock Branch
  SL_CLOCK_BRANCH_SYSRTCCLK,     ///< SYSRTCCLK Clock Branch
  SL_CLOCK_BRANCH_EUART0CLK,     ///< EUART0CLK Clock Branch
  SL_CLOCK_BRANCH_EUSART0CLK,    ///< EUSART0CLK Clock Branch
  SL_CLOCK_BRANCH_DPLLREFCLK,    ///< EUSART0CLK Clock Branch
  SL_CLOCK_BRANCH_I2C0CLK,       ///< I2C0CLK Clock Branch
  SL_CLOCK_BRANCH_LCDCLK,        ///< LCDCLK Clock Branch
  SL_CLOCK_BRANCH_PIXELRZCLK,    ///< PIXELRZCLK Clock Branch
  SL_CLOCK_BRANCH_PCNT0CLK,      ///< PCNT0CLK Clock Branch
  SL_CLOCK_BRANCH_PRORTCCLK,     ///< PCNT0CLK Clock Branch
  SL_CLOCK_BRANCH_SYSTICKCLK,    ///< SYSTICKCLK Clock Branch
  SL_CLOCK_BRANCH_LESENSEHFCLK,  ///< LESENSEHFCLK Clock Branch
  SL_CLOCK_BRANCH_VDAC0CLK,      ///< VDAC0CLK Clock Branch
  SL_CLOCK_BRANCH_VDAC1CLK,      ///< VDAC1CLK Clock Branch
  SL_CLOCK_BRANCH_USB0CLK,       ///< USB0CLK Clock Branch
  SL_CLOCK_BRANCH_INVALID        ///< INVALID Clock Branch
};

/** @} (end addtogroup technology_abstraction_clock) */

#ifdef __cplusplus
}
#endif

#endif // SL_TECHNOLOGY_ABSTRACTION_CLOCK_H
